import string
from pprint import pprint
from random import choice, randint
from dataclient import ConnectBD

def create_data_from_base(database: ConnectBD, number_person: int) -> None:

    """
    Функция для заполнения базы данных случайными данными. 
    """

    names = [
        "Александр",
        "Андрей",
        "Дмитрий",
        "Алексей",
        "Артём",
        "Иван",
        "Михаил",
        "Максим",
        "Сергей",
        "Антон",
        "Никита",
        "Егор",
        "Кирилл",
        "Даниил",
        "Ярослав",
        "Тимофей",
        "Владимир",
        "Илья",
        "Павел",
        "Арсений",
        "Матвей",
        "Роман",
        "Глеб",
        "Владислав",
        "Олег",
        "Евгений",
        "Николай",
        "Анатолий",
        "Василий",
        "Артур",
        "Константин",
        "Руслан",
        "Станислав",
        "Игорь",
        "Георгий",
        "Никола",
        "Семен",
        "Виталий",
        "Альберт",
        "Игор",
        "Виктор",
        "Алик",
        "Егорий",
        "Олегй",
        "Евген",
        "Ян",
        "Денис",
        "Борис",
        "Анатолийй",
        "Леонид",
        "Кирил",
        "Захар",
        "Фёдор",
        "Евгний",
        "Михаэл",
        "Миххаил",
        "Лев",
        "Георги",
        "Сандро",
        "Роберт",
        "Димур",
        "Юрий",
        "Денисй",
        "Анатолиий",
        "Алексшандер",
        "Сантгой",
        "Альбцеро",
        "Альбертй",
        "Рихард",
        "Ноал",
        "Леоша",
        "Бен",
        "Вэлентин",
        "Нильс",
        "Севем",
        "Миан",
        "Встла",
        "Ектор",
        "Рик",
        "Ицхак",
        "Макс",
        "Ибрахим",
        "Сатрио",
        "Аид",
        "Морис",
        "Муса",
        "Гийом",
        "Режис",
        "Альфедре",
        "Левис",
        "Нолен",
        "Жак",
        "Радж",
        "Уильям",
        "Фрэнк",
        "Генри",
        "Максимью",
        "Джанни",
        "Икеке",
        "Филл",
        "Яхин",
        "Алекс",
        "Бенчо",
        "Дуглас",
        "Имарие",
        "Каспьер",
        "Л"
    ]

    surnames = [
    "Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров", "Соколов", "Михайлов", "Новиков", "Федоров",
    "Морозов", "Волков", "Алексеев", "Лебедев", "Семенов", "Егоров", "Павлов", "Козлов", "Степанов", "Николаев",
    "Орлов", "Андреев", "Макаров", "Никитин", "Захаров", "Зайцев", "Соловьев", "Борисов", "Яковлев", "Григорьев",
    "Романов", "Воробьев", "Сергеев", "Кузьмин", "Фролов", "Александров", "Дмитриев", "Королев", "Гусев", "Киселев",
    "Ильин", "Максимов", "Поляков", "Сорокин", "Виноградов", "Ковалев", "Белов", "Медведев", "Антонов", "Тарасов",
    "Жуков", "Баранов", "Фёдоров", "Комаров", "Давыдов", "Беляев", "Герасимов", "Богданов", "Осипов", "Сидоров",
    "Матвеев", "Титов", "Марков", "Миронов", "Крылов", "Куликов", "Карпов", "Власов", "Мельников", "Денисов",
    "Гаврилов", "Тихонов", "Казаков", "Афанасьев", "Данилов", "Савельев", "Тимофеев", "Фомин", "Чернов", "Абрамов",
    "Мартынов", "Ефимов", "Федотов", "Щербаков", "Назаров", "Калинин", "Исаев", "Чернышев", "Быков", "Маслов",
    "Родионов", "Коновалов", "Лазарев", "Воронин", "Климов", "Филатов", "Пономарев", "Голубев", "Кудрявцев",
    "Прохоров", "Наумов", "Потапов"
]
    
    def generate_email():
        letters = string.ascii_lowercase
        email = ''.join(choice(letters) for _ in range(10))
        email += "@example.com"
        return email

    for id_ in range(1, number_person+1):
        name = choice(names)
        surname = choice(surnames)
        email = generate_email()

        database.add_client(
            first_name=name,
            last_name=surname,
            email=email
        )

        count_phone = randint(0, 4)

        for _ in range(count_phone):
            
            phone_number = int(f"7{randint(1111111111, 9999999999)}")

            try:
                database.add_phone(
                    phone=phone_number,
                    client_id=id_
                )
            except Exception:
                continue


# call_center = ConnectBD(
#     database="Имя базы данных",
#     user="Имя пользователя",
#     password="Пароль"
# )